---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotSplitOldMullions
source: html/3a555f5f-3a8d-ab45-395e-8bdd8a5d40e8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotSplitOldMullions Property

Split does not work on curtain walls containing mullions created in Revit prior to version 4.0. You may delete the mullions, place them again, and then proceed with splitting the wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSplitOldMullions { get; }
```